DTQX/DreamTravelHardware_STM32/User/src/main.c
/**
 *   @defgroup  eMPL
 *   @brief     Embedded Motion Processing Library
 *
 *   @{
 *       @file      main.c
 *       @brief     Test app for eMPL using the Motion Driver DMP image.
 */
 
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"
#include "stdio.h"

#include "uart.h"
#include "i2c.h"
#include "gpio.h"
#include "main.h"
#include "board-st_discovery.h"
    
#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "invensense.h"
#include "invensense_adv.h"
#include "eMPL_outputs.h"
#include "mltypes.h"
#include "mpu.h"
#include "log.h"
#include "packet.h"

#include "fusion.h"

/* Private typedef -----------------------------------------------------------*/
/* Data read from MPL. */
#define PRINT_ACCEL     (0x01)
#define PRINT_GYRO      (0x02)
#define PRINT_QUAT      (0x04)
#define PRINT_COMPASS   (0x08)
#define PRINT_EULER     (0x10)
#define PRINT_ROT_MAT   (0x20)
#define PRINT_HEADING   (0x40)
#define PRINT_PEDO      (0x80)
#define PRINT_LINEAR_ACCEL (0x100)
#define PRINT_GRAVITY_VECTOR (0x200)

volatile uint32_t hal_timestamp = 0;
#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

#define MOTION          (0)
#define NO_MOTION       (1)

/* Starting sampling rate. */
#define DEFAULT_MPU_HZ  (20)

#define FLASH_SIZE      (512)
#define FLASH_MEM_START ((void*)0x1800)

#define PEDO_READ_MS    (1000)
#define TEMP_READ_MS    (500)
// #define COMPASS_READ_MS (100)
#define COMPASS_READ_MS (10)

// other_fusion
float ax, ay, az, gx, gy, gz, mx, my, mz; // variables to hold latest sensor data values 
float aRes = 1.0/32768.0, gRes = 1.0/32768.0, mRes = 1.0/32768.0; // scale resolutions per LSB for the sensors
// float aRes = 2.0/16358.0, gRes = 2000.0/16358.0, mRes = 1.0/16358.0; // scale resolutions per LSB for the sensors
long accelCount[3];  // Stores the 16-bit signed accelerometer sensor output
long gyroCount[3];   // Stores the 16-bit signed gyro sensor output
long magCount[3];    // Stores the 16-bit signed magnetometer sensor output
#define PI 3.14159265358979323846f
float qt[4];



struct rx_s {
    unsigned char header[3];
    unsigned char cmd;
};
struct hal_s {
    unsigned char lp_accel_mode;
    unsigned char sensors;
    unsigned char dmp_on;
    unsigned char wait_for_tap;
    volatile unsigned char new_gyro;
    unsigned char motion_int_mode;
    unsigned long no_dmp_hz;
    unsigned long next_pedo_ms;
    unsigned long next_temp_ms;
    unsigned long next_compass_ms;
    unsigned int report;
    unsigned short dmp_features;
    struct rx_s rx;
};
static struct hal_s hal = {0};

/* USB RX binary semaphore. Actually, it's just a flag. Not included in struct
 * because it's declared extern elsewhere.
 */
volatile unsigned char rx_new;

unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";

/* Platform-specific information. Kinda like a boardfile. */
struct platform_data_s {
    signed char orientation[9];
};

/* The sensors can be mounted onto the board in any orientation. The mounting
 * matrix seen below tells the MPL how to rotate the raw data from the
 * driver(s).
 * TODO: The following matrices refer to the configuration on internal test
 * boards at Invensense. If needed, please modify the matrices to match the
 * chip-to-body matrix for your particular set up.
 */
static struct platform_data_s gyro_pdata = {
    .orientation = { 1, 0, 0,
                     0, 1, 0,
                     0, 0, 1}
};

#if defined MPU9150 || defined MPU9250
static struct platform_data_s compass_pdata = {
    .orientation = { 0, 1, 0,
                     1, 0, 0,
                     0, 0, -1}
};
#define COMPASS_ENABLED 1
#elif defined AK8975_SECONDARY
static struct platform_data_s compass_pdata = {
    .orientation = {-1, 0, 0,
                     0, 1, 0,
                     0, 0,-1}
};
#define COMPASS_ENABLED 1
#elif defined AK8963_SECONDARY
static struct platform_data_s compass_pdata = {
    .orientation = {-1, 0, 0,
                     0,-1, 0,
                     0, 0, 1}
};
#define COMPASS_ENABLED 1
#endif


/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* ---------------------------------------------------------------------------*/
/* Get data from MPL.
 * TODO: Add return values to the inv_get_sensor_type_xxx APIs to differentiate
 * between new and stale data.
 */


void float_char(float f,unsigned char *s)
{
    union change
    {
        float d;
        unsigned char dat[4];
    }rs;
    rs.d = f;
    *s = rs.dat[0];
    *(s+1) = rs.dat[1];
    *(s+2) = rs.dat[2];
    *(s+3) = rs.dat[3];
}


void my_send(long *quat){
    unsigned char out[28];
    int i;
    if (!quat)
        return;
    memset(out, 0, 28);
    out[0] = 88;
    out[1] = 88;
    // out[0] = '$';
    // out[1] = PACKET_QUAT;
    out[2] = (unsigned char)(quat[0] >> 24);
    out[3] = (unsigned char)(quat[0] >> 16);
    out[4] = (unsigned char)(quat[1] >> 24);
    out[5] = (unsigned char)(quat[1] >> 16);
    out[6] = (unsigned char)(quat[2] >> 24);
    out[7] = (unsigned char)(quat[2] >> 16);
    out[8] = (unsigned char)(quat[3] >> 24);
    out[9] = (unsigned char)(quat[3] >> 16);
    // out[10] = 44;
    // out[11] = 44;

    int tmp[4];
    tmp[0] = (int)(qt[0] * 100000000);
    tmp[1] = (int)(qt[1] * 100000000);
    tmp[2] = (int)(qt[2] * 100000000);
    tmp[3] = (int)(qt[3] * 100000000);

    out[10] = (uint8_t)(tmp[0] >> 24);
    out[11] = (uint8_t)(tmp[0] >> 16);
    out[12] = (uint8_t)(tmp[0] >> 8);
    out[13] = (uint8_t)tmp[0] ;
    out[14] = (uint8_t)(tmp[1] >> 24);
    out[15] = (uint8_t)(tmp[1] >> 16);
    out[16] = (uint8_t)(tmp[1] >> 8);
    out[17] = (uint8_t)tmp[1];
    out[18] = (uint8_t)(tmp[2] >> 24);
    out[19] = (uint8_t)(tmp[2] >> 16);
    out[20] = (uint8_t)(tmp[2] >> 8);
    out[21] = (uint8_t)tmp[2];
    out[22] = (uint8_t)(tmp[3] >> 24);
    out[23] = (uint8_t)(tmp[3] >> 16);
    out[24] = (uint8_t)(tmp[3] >> 8);
    out[25] = (uint8_t)tmp[3];


    out[26] = 44;
    out[27] = 44;
    
    for (i=0; i< 28; i++) {
      fputc(out[i]);
    }
}

