DTQX/DreamTravelHardware_STM32/User/src/main.c
                inv_build_accel(accel, 0, sensor_timestamp);
                new_data = 1;
            }
        }
#ifdef COMPASS_ENABLED
        if (new_compass) {
            short compass_short[3];
            long compass[3];
            new_compass = 0;
            /* For any MPU device with an AKM on the auxiliary I2C bus, the raw
             * magnetometer registers are copied to special gyro registers.
             */
            if (!mpu_get_compass_reg(compass_short, &sensor_timestamp)) {
                compass[0] = (long)compass_short[0];
                compass[1] = (long)compass_short[1];
                compass[2] = (long)compass_short[2];
                // 给其他算法添加值
                magCount[0] = compass_short[0];
                magCount[1] = compass_short[1];
                magCount[2] = compass_short[2];
                /* NOTE: If using a third-party compass calibration library,
                 * pass in the compass data in uT * 2^16 and set the second
                 * parameter to INV_CALIBRATED | acc, where acc is the
                 * accuracy from 0 to 3.
                 */
                inv_build_compass(compass, 0, sensor_timestamp);
            }
            new_data = 1;
        }
#endif
        if (new_data) {
            inv_execute_on_data();
            /* This function reads bias-compensated sensor data and sensor
             * fusion outputs from the MPL. The outputs are formatted as seen
             * in eMPL_outputs.c. This function only needs to be called at the
             * rate requested by the host.
             */
            
        }

        // 其他融合算法
            // 给其他算法添加值
            int8_t accuracy;
            unsigned long tmp_timestamp;

            inv_get_sensor_type_accel(accelCount, &accuracy, (inv_time_t*)&tmp_timestamp);
            inv_get_sensor_type_gyro(gyroCount, &accuracy, (inv_time_t*)&tmp_timestamp);
            
        #ifdef COMPASS_ENABLED
            inv_get_sensor_type_compass(magCount, &accuracy,(inv_time_t*)&tmp_timestamp);
        #endif
            // accelCount[0] = accelCount[0] >> 15;
            // accelCount[1] = accelCount[1] >> 15;
            // accelCount[2] = accelCount[2] >> 15;
            // accelCount[0] = accelCount[0] >> 15;
            // accelCount[1] = accelCount[1] >> 15;
            // accelCount[2] = accelCount[2] >> 15;

        // if(timestamp-last_timestamp>0){
            float deltat_time= (timestamp-last_timestamp)/1000.0f;
            other_fusion(deltat_time);
            // MPL_LOGI("\ndeltat_time : %d\n",timestamp);
            last_timestamp = timestamp;

            read_from_mpl();
        // }


            
    }
}
